---
kind: type
id: T:Autodesk.Revit.DB.Floor
zh: 楼板、板、地板
source: html/96cc6685-003d-ff90-1c5b-c25a4830f0f7.htm
---
# Autodesk.Revit.DB.Floor

**中文**: 楼板、板、地板

An object that represents a Floor within the Autodesk Revit project.

## Syntax (C#)
```csharp
public class Floor : CeilingAndFloor
```

## Remarks
This object derived from the Element base object and such supports all the
 methods of that object such as the ability to retrieve the parameters of that object.